tutorial/first-program.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Our First Program</title>
<!-- 2015-11-11 Wed 17:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Howard Abrams" />
</head>
<body>
<div id="content">
<h1 class="title">Our First Program</h1>
<p>
Our first <i>real</i> program will be quite simple: turn on a light.
(Didn’t realize that the four black circles at the bottom of the
simulator were lights?)
</p>

<p>
Type the following program:
</p>

<pre class="example">
1 129 1
</pre>

<p>
Click the <b>Load</b> button, and when you click the <b>Step</b> button, you
will see that the first light turned on, showing a red color.
</p>

<p>
The command, <code>1</code> is called <code>SET</code>, and it looks at the next memory
location for the number of another memory cell (in this case, <code>129</code>),
and changes whatever value is there with the third memory location (in
this case, we have another <code>1</code> value).
</p>

<p>
Putting <code>1</code> in memory location <code>129</code> turns the first light to red.
</p>

<p>
Change the value (not the command) to <code>2</code>, so you program should look
like this:
</p>

<pre class="example">
1 129 2
</pre>

<p>
Press <b>Load</b> and the light turns off (since the memory location <code>129</code>
now has a <code>0</code>. Press <b>Step</b> to run this new program command. What
color did the light turn on this time? Feel free to try different
values and see if you can come up with the pattern.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Command Mnemonics</h2>
<div class="outline-text-2" id="text-1">
<p>
Trying to remember that command <code>1</code> sets a memory location is
annoying, but remembering the number for every command possible can be
really taxing on a human brain.
</p>

<p>
Our loader will convert some <i>words</i> into command numbers. For
instance, our previous program could be written as:
</p>

<pre class="example">
SET 129 2
</pre>

<p>
Which is much more clear. Put that program into the system, and press
the <b>Load</b> button. What is in memory location <code>0</code>? That&rsquo;s right, it is
<code>1</code> since the <code>SET</code> command is automatically converted to a <code>1</code> when
it is read and stored into the memory cell.
</p>

<p>
From now on, we will put all commands as a three-letter command (often
abbreviated to make it fit in three letters).
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Hexadecimal</h2>
<div class="outline-text-2" id="text-2">
<p>
Click the <b>Dec &lt;-&gt; Hex</b> button and you will see that all values in our
memory change from decimal numbers that you are used to, to <a href="sub-hexadecimal.html">hexadecimal values</a>
that may look a little strange. Hexadecimal numbers are magical, and if you
are not careful, you can use them to curse other people. This is why
we call them <i>hex</i> numbers.
</p>

<p>
Since our computers are based on <a href="sub-binary.html">binary numbers</a> (and are also highly
resistant to magical energies), we often find it easier to program
with <i>hex</i> numbers.
</p>

<p>
Notice that our memory cell location <code>129</code> in <i>hex</i> is <code>81</code>, which
makes more sense since our first light should be tied to memory
location with a one in it, don&rsquo;t you think?
</p>

<p>
In our program, we can specify <i>hex</i> numbers by prefixing them with a <i>hashtag</i>.
The following program is exactly the same as our previous one:
</p>

<pre class="example">
SET #81 2
</pre>

<p>
Press <b>Load</b> and you will see that nothing really changed.
</p>

<p>
You can type part of your program with either <i>hex</i> numbers (if
prefixed with a hashtag) or decimal numbers, no matter what the <b>Dec
&lt;-&gt; Hex</b> button reads.
</p>

<p>
Well, we&rsquo;ve not written the same program three times in three
different ways. I think it must be time to write a more interesting
program.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2015 Nov 10</p>
<p class="author">Author: Howard Abrams</p>
<p class="date">Created: 2015-11-11 Wed 17:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
